app/controllers/posts_controller.rb

def create
  # when logged in the controller links current user to the post as it belongs to a user
  @post = current_user.posts.build(post_params)
  if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First post"], ["content", "This is the first of many to come to light"], ["user_id", 1], ["created_at", "2017-02-14 22:18:07.791187"], ["updated_at", "2017-02-14 22:18:07.791187"]]