app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (role= '0' OR role= '1')

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "puserv"], ["password_digest", "$2a$10$nbDqFIS9DVaEunZcKK44Auba87/JozT8rube02/cKjhNKkG98sN2O"], ["updated_at", "2017-02-26 13:24:27.598945"], ["id", 2]]